app/views/employees/new.html.erb

  <%= f.label 'Company' %>
  <%= f.collection_select :company_id, Company.order(:name), :id, :name, include_blank: true  %>
---
SELECT "companies".* FROM "companies" ORDER BY "companies"."name" ASC