app/views/companies/new.html.erb

  <%= f.label 'Parent' %>
  <%= f.collection_select :parent_id, Company.order(:name),:id,:name, include_blank: true  %>
---
SELECT "companies".* FROM "companies" ORDER BY "companies"."name" ASC