app/controllers/companies_controller.rb

SELECT "companies".* FROM "companies"
---
  def new
    @company = Company.new
    @all_companies = Company.all

SELECT "companies".* FROM "companies" WHERE "companies"."requirement_satisfied" = $1  [["requirement_satisfied", true]]
SELECT COUNT(*) FROM "companies" WHERE "companies"."requirement_satisfied" = $1  [["requirement_satisfied", false]]
SELECT "companies".* FROM "companies" WHERE "companies"."requirement_satisfied" = $1 ORDER BY "companies"."lft" ASC  [["requirement_satisfied", true]]
---
  def index
    @companies = Company.requirement_satisfied if params[:valid].present?
    @companies = Company.requirement_unsatisfied if params[:invalid].present?

    @companies ||= Company.all.order(:lft)

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @company = Company.find params[:id]

INSERT INTO "companies" ("name", "required_employees_count", "country", "lft", "rgt", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Acme"], ["required_employees_count", 5], ["country", "AX"], ["lft", 1], ["rgt", 2], ["created_at", "2021-10-31 19:17:40.381155"], ["updated_at", "2021-10-31 19:17:40.381155"]]
UPDATE "companies" SET "lft" = CASE WHEN "lft" BETWEEN 2 AND 2 THEN "lft" + 4 - 2 WHEN "lft" BETWEEN 3 AND 4 THEN "lft" + 2 - 3 ELSE "lft" END, "rgt" = CASE WHEN "rgt" BETWEEN 2 AND 2 THEN "rgt" + 4 - 2 WHEN "rgt" BETWEEN 3 AND 4 THEN "rgt" + 2 - 3 ELSE "rgt" END, "parent_id" = CASE WHEN "id" = 2 THEN 1 ELSE "parent_id" END, updated_at = '2021-10-31 19:18:06.053042' WHERE "companies"."id" IN (SELECT "companies"."id" FROM "companies" WHERE ("companies"."lft" BETWEEN 2 AND 4 OR "companies"."rgt" BETWEEN 2 AND 4) ORDER BY "companies"."lft" ASC)
---
  def respond_or_redirect(company)
    respond_to do |format|
      if company.save