app/controllers/companies_controller.rb

  def show
    @company = Company.find params[:id]
---
SELECT "companies".* FROM "companies"