app/controllers/employees_controller.rb

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1  [["id", 4]]
SELECT "employees".* FROM "employees" WHERE "employees"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @employee = Employee.includes(:company).find params[:id]

SELECT "employees".* FROM "employees" WHERE "employees"."company_id" = $1  [["company_id", 1]]
---
  def index
    @employees = if params[:company_id]
                   Employee.where(company_id: params[:company_id])

SELECT "companies".* FROM "companies" WHERE "companies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_company
    return unless params[:company_id]

    @company = Company.find params[:company_id]

INSERT INTO "employees" ("company_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["company_id", 2], ["created_at", "2021-10-31 17:27:42.854722"], ["updated_at", "2021-10-31 17:27:42.854722"]]
---
  def respond_or_redirect(employee)
    respond_to do |format|
      if employee.save