app/models/company.rb

UPDATE "companies" SET "total_employees_count" = $1, "updated_at" = $2 WHERE "companies"."id" = $3  [["total_employees_count", 1], ["updated_at", "2021-10-31 19:28:59.075149"], ["id", 1]]
---
  def update_ancestral_emp_count!
    self_and_ancestors.each do |company|
      company.increment_total_emp_count!